---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures.CreationFailed
source: html/fbc36b17-8d42-96a3-4147-c8f361d82cf0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures.CreationFailed Property

Matchline top extent should be higher than its bottom.

## Syntax (C#)
```csharp
public static FailureDefinitionId CreationFailed { get; }
```